{
  "komal@gmail.com": [
    {
      "destination": "Manali",
      "interests": "trek ,culture, food,adventure",
      "days": 3,
      "start_date": "2025-07-14",
      "budget_per_day": 1000.0,
      "favorite": false,
      "itinerary": "## Manali 3-Day Itinerary (July 14-16, 2025) - Trek, Culture, Food & Adventure (₹1000/day Budget)\n\nThis itinerary balances adventure, cultural experiences, and delicious food while sticking to a ₹1000/day budget. It focuses on maximizing value and utilizes local transport where possible.\n\n**Day 1 (July 14, 2025) - Arrival & Old Manali Exploration**\n\n* **Morning (Budget: ₹300):** Arrive at Manali Bus Stand. Take a local bus or shared taxi to Old Manali (₹30-50). Check into a pre-booked budget guesthouse/hostel in Old Manali (₹300-500/night, aim for the lower end).  Freshen up and leave your luggage.\n* **Afternoon (Budget: ₹250):** Explore the charming streets of Old Manali. Visit the Manu Temple, a significant Hindu shrine. Cross the iconic bridge over the Manalsu River. Enjoy lunch at a local cafe – try a plate of momos or thukpa (₹100-150).\n* **Evening (Budget: ₹450):** Hike up to the Hidimba Devi Temple, nestled in a cedar forest (free entry). Enjoy the peaceful atmosphere and panoramic views. Indulge in street food like aaloo tikki or a hot cup of chai (₹50-100). Enjoy dinner at a budget-friendly restaurant in Old Manali (₹300-400). Explore the vibrant cafes and shops in the evening.\n\n**Day 2 (July 15, 2025) - Beas Kund Trek & Riverside Camping (Budget: ₹900)**\n\n* **Morning (Budget: ₹200):** Start early for the Beas Kund Trek (a moderate one-day trek). Hire a shared taxi or take a local bus to Dhundi, the starting point (₹100-150). Pack a basic lunch (sandwiches, fruits, water) from a local shop (₹50-100).\n* **Daytime (Budget: ₹200):** Trek to Beas Kund, the origin of the Beas River. Enjoy breathtaking views of the surrounding mountains and glaciers. The trek is around 6-8 hours round trip. (No entry fee for the trek itself).\n* **Evening (Budget: ₹500):** If the weather permits and you're comfortable with it, consider camping near the river in Dhundi or a designated camping area (permissions might be required; inquire locally).  Camping equipment can be rented in Manali if you haven't brought your own (rental cost factored into budget). Alternatively, return to Old Manali by evening bus/shared taxi (₹100-150) and enjoy dinner at a local restaurant (₹200-300).\n\n**Day 3 (July 16, 2025) - Solang Valley Adventure & Departure (Budget: ₹900)**\n\n* **Morning (Budget: ₹400):** Take a local bus or shared taxi to Solang Valley (₹50-80). Enjoy adventure activities like paragliding (₹2000-₹3000, consider skipping if strictly adhering to budget), zorbing (₹300-₹500), or a short ropeway ride (₹500-₹700). Choose one activity based on your preference and budget. Enjoy the scenic beauty of the valley. Have a simple breakfast at a stall near Solang (₹50-100).\n* **Afternoon (Budget: ₹300):** Have lunch at a dhaba in Solang Valley (₹150-200). Visit the Anjani Mahadev Temple near Solang. Explore the local shops for souvenirs (optional). Return to Manali town by bus/shared taxi (₹50-80).\n* **Evening (Budget: ₹200):** Explore the Mall Road in Manali town. Enjoy a final Manali dinner at a local restaurant (₹150-200). Depart from Manali Bus Stand.\n\n\n**Important Notes:**\n\n* **Accommodation:** Pre-booking budget guesthouses or hostels in Old Manali is highly recommended, especially during peak season. Dorm beds can further reduce costs.\n* **Food:** Local dhabas and street food stalls offer delicious and budget-friendly meals.\n* **Transport:** Utilize local buses and shared taxis to minimize transportation costs.\n* **Trekking:** Pack essentials like water, snacks, comfortable shoes, and a light jacket for the Beas Kund trek. Check weather conditions beforehand.\n* **Permits:** Enquire about any necessary permits for camping near Beas Kund.\n* **Bargaining:** Negotiate prices for souvenirs and adventure activities.\n* **Flexibility:** This itinerary is a suggestion and can be adjusted based on your preferences and time constraints.\n* **Safety:** Prioritize safety during treks and adventure activities. Be mindful of your surroundings.\n\nThis itinerary prioritizes experiences while respecting the budget. Some adjustments might be needed based on your specific interests and the actual costs in 2025. Have a fantastic trip to Manali!\n"
    },
    {
      "destination": "Delhi",
      "interests": "temples, culture, food",
      "days": 3,
      "start_date": "2025-07-19",
      "budget_per_day": 500.0,
      "favorite": false,
      "itinerary": "## Delhi 3-Day Itinerary (July 19-21, 2025) - Budget-Friendly Cultural & Foodie Adventure (₹500/day)\n\nThis itinerary focuses on maximizing your Delhi experience while staying within your budget, utilizing public transport (Delhi Metro is your best friend!). Food costs are estimated, allowing flexibility based on your choices.\n\n**Day 1: Old Delhi Charm (Saturday, July 19, 2025)**\n\n* **Morning (₹150):**\n    * Start your day with a visit to the **Jama Masjid**, one of India's largest mosques (Free Entry). Marvel at the architecture and soak in the atmosphere.\n    * Enjoy a delicious breakfast of *parathas* and *chai* at a local eatery near Jama Masjid (₹50-70).\n* **Afternoon (₹200):**\n    * Explore the bustling lanes of **Chandni Chowk**. Immerse yourself in the vibrant market, browsing through spices, fabrics, and jewelry.\n    * Have a fulfilling lunch of *chaat* and street food delicacies in Chandni Chowk (₹80-100).\n    * Visit the **Red Fort** (₹60 entry for Indians, more for foreigners), a UNESCO World Heritage Site, and witness its grandeur.\n* **Evening (₹150):**\n    * Experience a serene evening at **Gurudwara Bangla Sahib**, a beautiful Sikh temple known for its golden dome and soothing hymns. Enjoy the *langar* (free community meal) – a heartwarming cultural experience.\n    * Return to your accommodation by metro.\n\n**Day 2: New Delhi Explorations (Sunday, July 20, 2025)**\n\n* **Morning (₹150):**\n    * Visit **Akshardham Temple** (Free entry to the complex, exhibitions are charged).  Explore the magnificent temple complex, admire the intricate carvings and enjoy the water show (check show timings and costs if interested - may exceed budget).\n    * Have a simple South Indian breakfast near Akshardham (₹50-70).\n* **Afternoon (₹200):**\n    * Explore **Connaught Place**, a vibrant commercial hub with colonial architecture. Enjoy some window shopping and soak in the atmosphere.\n    *  Have lunch at a budget-friendly restaurant in Connaught Place (₹80-100). Consider trying *chhole bhature* or *rajma chawal*.\n    * Visit **India Gate**, a war memorial, and stroll through the surrounding gardens.\n* **Evening (₹150):**\n    * Explore **Dilli Haat**, a crafts bazaar showcasing diverse Indian cultures. Enjoy the vibrant atmosphere, shop for handicrafts, and enjoy regional snacks (budget carefully).\n    * Return to your accommodation by metro.\n\n**Day 3: Spiritual & Historical Delights (Monday, July 21, 2025)**\n\n* **Morning (₹150):**\n    * Visit the **Lotus Temple**, a Baha'i House of Worship known for its unique architecture (Free Entry). Enjoy the peaceful atmosphere and meditate for a while.\n    * Have a light breakfast near the Lotus Temple (₹50-70).\n* **Afternoon (₹250):**\n    * Explore **Humayun's Tomb** (₹60 entry for Indians, more for foreigners), a precursor to the Taj Mahal, and admire its beautiful Mughal architecture.\n    * Visit **Qutub Minar** (₹60 entry for Indians, more for foreigners), a towering minaret, and explore the surrounding historical complex.\n    * Have lunch at a local eatery near Qutub Minar (₹70-90).\n* **Evening (₹100):**\n    * Enjoy some street food at a local market near your accommodation. Explore local markets like Lajpat Nagar or Sarojini Nagar for budget-friendly shopping (optional).\n\n**Important Notes:**\n\n* **Accommodation:** This itinerary doesn't include accommodation costs. Look for budget-friendly options like hostels or guesthouses to stay within your budget.\n* **Transportation:** Delhi Metro is the most affordable and efficient mode of transport. Recharge a metro card for seamless travel.\n* **Food:** Explore local eateries and street food stalls for delicious and affordable meals. Bottled water is recommended.\n* **Flexibility:** This is a suggested itinerary; feel free to adjust it based on your interests and time constraints.\n* **Bargaining:** Don't hesitate to bargain while shopping in markets like Chandni Chowk and Dilli Haat.\n\nThis itinerary offers a blend of cultural experiences, spiritual exploration, historical sightseeing, and delicious food while respecting your budget. Enjoy your Delhi adventure!\n"
    },
    {
      "destination": "Kyoto",
      "interests": "temples, culture, food",
      "days": 3,
      "start_date": "2025-07-19",
      "budget_per_day": 1000.0,
      "favorite": false,
      "itinerary": "## Kyoto 3-Day Itinerary (July 19-21, 2025) - Budget-Friendly Cultural Immersion\n\n**Daily Budget:** ₹1000 (approx. ¥1800) -  This itinerary focuses on maximizing value while experiencing Kyoto's highlights. Food costs are estimated conservatively and can be adjusted based on your preferences.\n\n**Note:** Transportation within Kyoto can be done efficiently using buses and subways. Consider a day pass for optimal cost savings.\n\n**Day 1 (July 19, 2025): Eastern Kyoto - Temples & Nature**\n\n* **Morning (¥500):** Start your day early at **Fushimi Inari Shrine**.  Marvel at the thousands of vibrant red torii gates winding up the mountain.  Pack a simple breakfast or grab onigiri from a local convenience store to save on costs.\n* **Afternoon (¥700):**  Take the train to **Kiyomizu-dera Temple**. Explore the wooden stage and enjoy panoramic views of Kyoto. Afterwards, wander through the charming streets of **Higashiyama district**, browsing through pottery shops and tea houses.  Enjoy a matcha soft serve or a traditional Japanese sweet.\n* **Evening (¥600):**  Have dinner at **Nishiki Market**, Kyoto's kitchen. Explore the diverse stalls and sample affordable street food like yakitori, takoyaki, or fresh seafood.\n\n**Day 2 (July 20, 2025): Northern Kyoto - Zen Gardens & Bamboo Forest**\n\n* **Morning (¥400):**  Visit **Kinkaku-ji (Golden Pavilion)**, the iconic gold-leaf covered temple.  Take your time to appreciate the serene reflections in the pond.  \n* **Afternoon (¥600):** Immerse yourself in the tranquility of **Ryoan-ji Temple's Zen garden**. Contemplate the enigmatic rock formations. Afterwards, explore the enchanting **Arashiyama Bamboo Grove**. \n* **Evening (¥800):**  Enjoy a budget-friendly dinner in the Pontocho alley, known for its small restaurants and bars along the Kamogawa River. Consider trying ramen or a simple donburi (rice bowl).\n\n**Day 3 (July 21, 2025): Central & Western Kyoto - Imperial Palace & Nishiki Market Deep Dive**\n\n* **Morning (¥300):** Visit the **Kyoto Imperial Palace**, the former residence of the Emperor. Free guided tours are available (reservations recommended). Afterwards, explore the nearby **Kyoto Gyoen National Garden**, a peaceful oasis in the city center. Grab an inexpensive onigiri or sandwich for lunch.\n* **Afternoon (¥700):** Dedicate a larger chunk of your afternoon to exploring **Nishiki Market** in greater depth. Sample more local delicacies, shop for souvenirs, and engage with the friendly vendors.  \n* **Evening (¥700):** Enjoy a final Kyoto dinner in the Gion district. While known for expensive geisha entertainment, you can find more affordable options in the backstreets. Consider okonomiyaki (savory pancake) or udon noodles.\n\n\n**Tips for Saving Money:**\n\n* **Accommodation:** Consider staying in a hostel or a budget-friendly guesthouse to maximize your daily budget.\n* **Transportation:** Purchase a Kyoto City Bus and Subway One-Day Pass for cost-effective travel.  Walking and cycling are also great options.\n* **Food:** Embrace the affordable and delicious world of Japanese convenience stores (konbini) for breakfast and snacks.  Explore local markets and street food stalls for budget-friendly meals.\n* **Free Activities:** Take advantage of the many free temples and shrines, parks, and walking paths throughout Kyoto.\n* **Temple Combo Tickets:** Look for combined temple entry tickets for discounted access to multiple sites.\n\n\nThis itinerary is a suggestion and can be customized to your preferences.  Enjoy your cultural exploration of Kyoto! \n"
    },
    {
      "destination": "Gangtok",
      "interests": "temples, culture, food",
      "days": 3,
      "start_date": "2025-07-20",
      "budget_per_day": 1000.0,
      "favorite": false,
      "itinerary": "## Gangtok 3-Day Itinerary (July 20-22, 2025) - Temples, Culture & Food (₹1000/day Budget)\n\nThis itinerary focuses on exploring Gangtok's cultural and spiritual side while enjoying local delicacies, all within a reasonable budget.\n\n**Day 1 (July 20, 2025) - Arrival and Monastery Visit**\n\n* **Morning (₹300):** Arrive at Bagdogra Airport (IXB) or New Jalpaiguri Railway Station (NJP). Shared jeeps/taxis to Gangtok are readily available (₹200-₹300). Check into a pre-booked budget hotel/guesthouse near MG Marg (₹500-₹700/night – aim for the lower end).  Have a quick and affordable breakfast of momos or thukpa at a local eatery.\n* **Afternoon (₹300):** Visit Rumtek Monastery (₹20 for entry, taxi ₹100-₹150 return).  Explore the vibrant architecture and learn about Tibetan Buddhism.  Enjoy the peaceful atmosphere and scenic views. Return to Gangtok and explore the local markets.\n* **Evening (₹400):** Stroll through MG Marg, the heart of Gangtok.  Enjoy street food like momos, rolls, and thukpa. Have dinner at a local restaurant serving Sikkimese cuisine like Gundruk and Dhindo (try Roll House or Taste of Tibet for budget-friendly options).\n\n**Day 2 (July 21, 2025) - Culture and Cable Car**\n\n* **Morning (₹300):** Visit the Directorate of Handicrafts & Handloom (nominal entry fee). Explore the traditional crafts of Sikkim.  Next, visit the Namgyal Institute of Tibetology (₹10 entry) to learn more about Tibetan culture and literature.  Enjoy a simple breakfast of puri-sabzi at a local eatery.\n* **Afternoon (₹400):** Take a ride on the Gangtok Ropeway (₹150-₹200) for panoramic views of the city and surrounding mountains.  Visit the Ganesh Tok temple near the upper cable car station.  Enjoy some local snacks and tea at the viewpoints.\n* **Evening (₹300):** Explore Lal Bazaar, a vibrant local market.  Enjoy dinner at a local restaurant or try more street food delicacies. Consider trying a traditional Sikkimese Thali.\n\n**Day 3 (July 22, 2025) – Tashi Viewpoint and Departure**\n\n* **Morning (₹400):**  Early morning visit to Tashi Viewpoint (taxi ₹200-₹300 return, nominal entry fee) for stunning views of Mt. Kanchenjunga (weather permitting). Have breakfast at a local eatery near the viewpoint.\n* **Afternoon (₹300):**  Visit the Enchey Monastery, a historically significant Buddhist monastery, located near Gangtok city (taxi ₹100-₹150 return, nominal entry fee). Explore MG Marg for souvenir shopping. Enjoy a final lunch of Sikkimese cuisine.\n* **Evening (₹300):**  Depart from Gangtok to Bagdogra Airport (IXB) or New Jalpaiguri Railway Station (NJP) via shared jeep/taxi (₹200-₹300).\n\n**Tips for Budget Travel:**\n\n* **Accommodation:** Book budget hotels or guesthouses in advance, especially during peak season.\n* **Food:** Opt for local eateries and street food for affordable and delicious meals.\n* **Transport:** Utilize shared jeeps and taxis to save on transportation costs. Negotiate fares beforehand.\n* **Activities:**  Choose affordable activities like visiting monasteries, markets, and viewpoints.\n* **Bargaining:**  Don't hesitate to bargain while shopping at local markets.\n\n\n**Note:**\n\n* This itinerary is a suggestion and can be customized based on your preferences.\n* Prices mentioned are approximate and may vary.\n* Carry sufficient cash as ATMs might not be readily available everywhere.\n* Pack for varying weather conditions as Gangtok can be unpredictable.\n* Respect local customs and traditions.\n\n\nEnjoy your cultural and spiritual journey in Gangtok!\n"
    },
    {
      "destination": "Prayagraj",
      "interests": "temples, culture, food",
      "days": 3,
      "start_date": "2025-07-20",
      "budget_per_day": 500.0,
      "favorite": false,
      "itinerary": "## Prayagraj Pilgrimage: 3-Day Itinerary (July 20-22, 2025) - Budget ₹500/day\n\nThis itinerary focuses on exploring Prayagraj's spiritual and cultural heart while enjoying local flavors within a tight budget.\n\n**Day 1: Confluence of Faith (July 20, 2025)**\n\n* **Morning (₹100):** Arrive at Prayagraj Junction. Take a shared auto (₹20-30) to your pre-booked budget accommodation near the Sangam area (e.g., Dharamshala or budget hotel - ₹200-300/night). Freshen up and head to the Triveni Sangam. Witness the holy confluence and take a boat ride (₹50-70 per person) for a closer view.  \n* **Afternoon (₹150):** Enjoy a simple and delicious lunch at a local eatery near the Sangam. Try the famous Prayagraj Kachori Sabzi and Lassi (₹50-70). Afterwards, visit the Bade Hanuman Ji Temple near the fort. The reclining Hanuman statue is unique and a must-see (Free entry).\n* **Evening (₹150):** Attend the Ganga Aarti at the Sangam. The spiritual atmosphere is truly captivating (Free).  Enjoy street food like chaat and golgappas for dinner (₹50-80) before returning to your accommodation.\n\n**Day 2: Forts, Temples, and Local Delights (July 21, 2025)**\n\n* **Morning (₹100):** Visit the Allahabad Fort (entry fee ₹25). Explore Akshayavat, Patalpuri Temple, and the magnificent architecture.  Note: Photography inside certain areas may be restricted.\n* **Afternoon (₹150):**  Enjoy lunch at a local restaurant trying a thali for a variety of flavors (₹60-80).  Visit the  Khusro Bagh, a historical garden complex housing the tombs of Mughal prince Khusrau and his family (Entry nominal if any). \n* **Evening (₹150):** Explore the local markets like Chowk and Katra. Enjoy street shopping and savour some local sweets like Malaiyo in winter or Kulfi in summer (₹50-70). Have dinner at a local eatery - try the famous Tehri (₹30-50).\n\n**Day 3: Spirituality and Departure (July 22, 2025)**\n\n* **Morning (₹100):** Visit the Anand Bhavan, the historic Nehru family home, now a museum (Entry fee ₹20-30).  Explore the exhibits showcasing India's freedom struggle.\n* **Afternoon (₹100):**  Have lunch at a local restaurant (₹50-70). Visit the  Bharadwaj Ashram, believed to be the ancient hermitage of Sage Bharadwaj (Free).\n* **Evening (₹100):** Depending on your departure time, visit the local markets for souvenir shopping. Have a light snack (₹30-40) before heading to Prayagraj Junction for your onward journey.\n\n\n**Tips for Staying Within Budget:**\n\n* **Accommodation:** Opt for budget-friendly options like dharamshalas, guesthouses, or budget hotels near the Sangam or Civil Lines area.\n* **Food:** Embrace street food and local eateries for delicious and affordable meals. Thalis offer excellent value for money.\n* **Transport:** Utilize shared autos, cycle rickshaws, and public buses for local transport. Walking is also a great option for exploring areas near the Sangam.\n* **Bargaining:** Don't hesitate to bargain respectfully while shopping in local markets.\n* **Water:** Carry a reusable water bottle and refill it at your accommodation or filtered water kiosks to save on buying bottled water.\n\n**Note:**\n\n*  This itinerary is a suggestion and can be adjusted based on your interests and time constraints.\n*  The budget is an estimate and can vary based on individual spending habits.\n*  During festivals and peak seasons, prices may be slightly higher, so plan accordingly.\n* Pre-booking accommodation, especially during peak season, is highly recommended.\n\n\nEnjoy your spiritual and cultural journey in Prayagraj! \n"
    }
  ],
  "ria@gmail.com": [
    {
      "destination": "Kyoto",
      "interests": "temples, culture, food",
      "days": 3,
      "start_date": "2025-07-16",
      "budget_per_day": 1000.0,
      "favorite": false,
      "itinerary": "## Kyoto 3-Day Itinerary (July 16-18, 2025) - Budget-Friendly Cultural Immersion (₹1000/day approx.)\n\n**Note:** ₹1000 is roughly ¥1800. This itinerary focuses on maximizing value while experiencing Kyoto's highlights. Food costs are estimated, and you can adjust based on your preferences. Transportation costs are based on using public transport (buses and subways).\n\n**Day 1: Eastern Kyoto - Temples and Tea** (2025-07-16)\n\n* **Morning:**  Fushimi Inari Shrine (Free). Arrive early (around 8 am) to beat the crowds and enjoy the thousands of vermillion torii gates.\n* **Mid-day:** Nishiki Market (Free to browse, budget ¥1000 for lunch). Explore the \"Kitchen of Kyoto\" and sample local delicacies like pickles, tofu donuts, and fresh seafood.  Grab a cheap and delicious lunch from a street vendor.\n* **Afternoon:** Kiyomizu-dera Temple (¥400). Marvel at the wooden stage and panoramic views. Explore the surrounding Higashiyama district with its traditional shops and teahouses.\n* **Evening:** Gion District (Free to wander).  Stroll through the geisha district hoping to catch a glimpse of a geiko or maiko. Enjoy a budget-friendly dinner at a ramen shop (¥800-¥1000).\n\n\n**Day 2: Northern Kyoto - Zen Gardens and Bamboo Forest** (2025-07-17)\n\n* **Morning:**  Kinkaku-ji (Golden Pavilion) (¥400). Visit this iconic gold-leaf covered temple and its serene gardens.\n* **Mid-day:** Ryoan-ji Temple (¥500). Contemplate the famous Zen rock garden and enjoy the peaceful atmosphere. Pack a bento box lunch (¥500-¥700 from a convenience store) to enjoy in the temple gardens for a budget-friendly meal.\n* **Afternoon:** Arashiyama Bamboo Grove (Free). Immerse yourself in the towering bamboo stalks and explore the charming streets of Arashiyama.  Enjoy some matcha soft serve (¥300-¥400).\n* **Evening:** Return to central Kyoto.  Enjoy a casual dinner at an Okonomiyaki restaurant (¥800-¥1000).\n\n\n**Day 3: Western Kyoto - Imperial Palace and Nishiki Market Redux** (2025-07-18)\n\n* **Morning:** Kyoto Imperial Palace (Free, requires reservation). Explore the former residence of the Emperor. Book a free tour in advance online.\n* **Mid-day:** Nijo Castle (¥600). Witness the opulent castle of the Tokugawa shogunate and its \"nightingale floors.\" \n* **Afternoon:**  Return to Nishiki Market to pick up some souvenirs and enjoy a final stroll through the vibrant atmosphere. Grab a light lunch from a street vendor (¥500-¥700).\n* **Evening:** Enjoy a farewell dinner at a local Izakaya (Japanese pub) for a taste of various small dishes and drinks (budget ¥1000-¥1500, potentially slightly exceeding the daily limit but a good final experience).\n\n\n**Budget Breakdown (Approximate):**\n\n* **Entrance Fees:** ¥1900 (across three days)\n* **Food:** ¥2100 - ¥2700 (per day)\n* **Transportation:** ¥300-¥500 (per day, estimated using buses and subway)\n\n**Tips for Staying Within Budget:**\n\n* **Travel during off-season:** July can be hot and humid, but you might find slightly cheaper accommodation.\n* **Utilize the Kyoto City Bus & Subway Pass:** Depending on your travel plans, this pass can offer savings.\n* **Stay in a hostel or guesthouse:** These offer budget-friendly accommodation options.\n* **Eat at local restaurants and street food stalls:** Avoid tourist traps and embrace the local culinary scene for delicious and affordable meals.\n* **Pack snacks and drinks:** This can save money, especially for midday snacks.\n* **Take advantage of free activities:**  Walking around, exploring parks, and visiting smaller shrines are free and enjoyable.\n\n\nThis itinerary provides a balanced mix of iconic landmarks, cultural experiences, and delicious food while respecting your budget. Remember to adjust it based on your interests and preferences.  Enjoy your trip to Kyoto! \n"
    },
    {
      "destination": "Manali",
      "interests": "trek ,culture, food,adventure",
      "days": 3,
      "start_date": "2025-07-14",
      "budget_per_day": 10000.0,
      "favorite": false,
      "itinerary": "## Manali 3-Day Itinerary (July 14-16, 2025) - Trek, Culture, Food & Adventure (₹1000/day Budget)\n\nThis itinerary balances adventure, cultural experiences, and delicious food while sticking to a ₹1000/day budget. It focuses on maximizing value and utilizes local transport where possible.\n\n**Day 1 (July 14, 2025) - Arrival & Old Manali Exploration**\n\n* **Morning (Budget: ₹300):** Arrive at Manali Bus Stand. Take a local bus or shared taxi to Old Manali (₹30-50). Check into a pre-booked budget guesthouse/hostel in Old Manali (₹300-500/night, aim for the lower end).  Freshen up and leave your luggage.\n* **Afternoon (Budget: ₹250):** Explore the charming streets of Old Manali. Visit the Manu Temple, a significant Hindu shrine. Cross the iconic bridge over the Manalsu River. Enjoy lunch at a local cafe – try a plate of momos or thukpa (₹100-150).\n* **Evening (Budget: ₹450):** Hike up to the Hidimba Devi Temple, nestled in a cedar forest (free entry). Enjoy the peaceful atmosphere and panoramic views. Indulge in street food like aaloo tikki or a hot cup of chai (₹50-100). Enjoy dinner at a budget-friendly restaurant in Old Manali (₹300-400). Explore the vibrant cafes and shops in the evening.\n\n**Day 2 (July 15, 2025) - Beas Kund Trek & Riverside Camping (Budget: ₹900)**\n\n* **Morning (Budget: ₹200):** Start early for the Beas Kund Trek (a moderate one-day trek). Hire a shared taxi or take a local bus to Dhundi, the starting point (₹100-150). Pack a basic lunch (sandwiches, fruits, water) from a local shop (₹50-100).\n* **Daytime (Budget: ₹200):** Trek to Beas Kund, the origin of the Beas River. Enjoy breathtaking views of the surrounding mountains and glaciers. The trek is around 6-8 hours round trip. (No entry fee for the trek itself).\n* **Evening (Budget: ₹500):** If the weather permits and you're comfortable with it, consider camping near the river in Dhundi or a designated camping area (permissions might be required; inquire locally).  Camping equipment can be rented in Manali if you haven't brought your own (rental cost factored into budget). Alternatively, return to Old Manali by evening bus/shared taxi (₹100-150) and enjoy dinner at a local restaurant (₹200-300).\n\n**Day 3 (July 16, 2025) - Solang Valley Adventure & Departure (Budget: ₹900)**\n\n* **Morning (Budget: ₹400):** Take a local bus or shared taxi to Solang Valley (₹50-80). Enjoy adventure activities like paragliding (₹2000-₹3000, consider skipping if strictly adhering to budget), zorbing (₹300-₹500), or a short ropeway ride (₹500-₹700). Choose one activity based on your preference and budget. Enjoy the scenic beauty of the valley. Have a simple breakfast at a stall near Solang (₹50-100).\n* **Afternoon (Budget: ₹300):** Have lunch at a dhaba in Solang Valley (₹150-200). Visit the Anjani Mahadev Temple near Solang. Explore the local shops for souvenirs (optional). Return to Manali town by bus/shared taxi (₹50-80).\n* **Evening (Budget: ₹200):** Explore the Mall Road in Manali town. Enjoy a final Manali dinner at a local restaurant (₹150-200). Depart from Manali Bus Stand.\n\n\n**Important Notes:**\n\n* **Accommodation:** Pre-booking budget guesthouses or hostels in Old Manali is highly recommended, especially during peak season. Dorm beds can further reduce costs.\n* **Food:** Local dhabas and street food stalls offer delicious and budget-friendly meals.\n* **Transport:** Utilize local buses and shared taxis to minimize transportation costs.\n* **Trekking:** Pack essentials like water, snacks, comfortable shoes, and a light jacket for the Beas Kund trek. Check weather conditions beforehand.\n* **Permits:** Enquire about any necessary permits for camping near Beas Kund.\n* **Bargaining:** Negotiate prices for souvenirs and adventure activities.\n* **Flexibility:** This itinerary is a suggestion and can be adjusted based on your preferences and time constraints.\n* **Safety:** Prioritize safety during treks and adventure activities. Be mindful of your surroundings.\n\nThis itinerary prioritizes experiences while respecting the budget. Some adjustments might be needed based on your specific interests and the actual costs in 2025. Have a fantastic trip to Manali!\n"
    }
  ]
}